app/controllers/tracks_controller.rb

  def index
    @tracks = Track.all
---
SELECT "tracks".* FROM "tracks"

  def show
    #raise params.inspect
    @track = Track.find(params[:id])
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @track = Track.new(params[:track])

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 28 Apr 2012 05:16:50 UTC +00:00], ["title", "sankehips"], ["updated_at", Sat, 28 Apr 2012 05:16:50 UTC +00:00]]